app/controllers/todos_controller.rb

  def show
    @todo = Todo.find params[:id]
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @todo = Todo.new params[:todo]
    if @todo.save
---
INSERT INTO "todos" ("body", "list_name", "status", "title", "todo_count") VALUES (?, ?, ?, ?, ?)  [["body", "Kris"], ["list_name", ""], ["status", 0], ["title", "kris"], ["todo_count", nil]]

  def edit
    @todo = Todo.find params[:id]
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @todo = Todo.find params[:id]
    if @todo.update_attributes params[:todo]
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "todos" SET "todo_count" = 3 WHERE "todos"."list_name" = 'hello-you'

  def load_todos
    @todos = Todo.all
---
SELECT "todos".* FROM "todos"